<template>
    <div class="page-body pa-3" v-if="!loading">
        <v-card max-width="1024" outlined class="card-consent pt-9 mx-auto overflow-y-auto" flat>
            <!-- <v-card class="mx-auto" flat width="300" height="115">
          <v-img src="../../assets/img/guildline.png"></v-img>
        </v-card> -->

            <div class="text-title px-3 mt-6">
                <p class="">
                    ความยินยอมในการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล
                    ผู้ใช้งานระบบสมาชิกของสมาคมธุรกิจเวชภัณฑ์สัตว์
                </p>
            </div>

            <div class="card-info mt-3">
                <p class="info-title">
                    1. วัตถุประสงค์ในการเก็บรวบรวม/ใช้/เปิดเผย ข้อมูลส่วนบุคคล
                </p>

                <p class="info-indent mt-n3">
                    ในกรณีที่ท่านเป็นผู้ใช้งานระบบสมาชิกข้อมูลส่วนบุคคลของท่านจะถูกเก็บไว้และอาจถูกใช้เพื่อวัตถุประสงค์ดังต่อไปนี้
                </p>

                <p class="info-indent mt-n3">
                    1. เพื่อใช้ในการยืนยันตัวตน และระบุตัวตนในระบบสมาชิกของสมาคมธุรกิจเวชภัณฑ์สัตว์
                </p>

                <p class="info-indent mt-n3">
                    2. เพื่อเป็นช่องทางในการติดต่อสื่อสารระหว่างสมาชิกสมาคมธุรกิจเวชภัณฑ์สัตว์ เช่น การทำธุรกรรม,
                    การสมัครสมาชิก, สิทธิประโยชน์, และการขอใบรับรองอิเล็กทรอนิกส์ (CA), การต่ออายุใบอนุญาต เป็นต้น
                </p>

                <p class="info-indent mt-n3">
                    3. เพื่อเป็นการพัฒนาฐานข้อมูลกลางสมาคมธุรกิจเวชภัณฑ์สัตว์ ให้มีความถูกต้องครอบคลุม แม่นยำ
                    เชื่อถือได้ เพื่อนำไปสู่ระบบการบริหารงานสมาคมธุรกิจเวชภัณฑ์สัตว์
                </p>

                <p class="info-indent mt-n3">
                    4. เพื่อพัฒนาระบบสมาชิกของสมาคมธุรกิจเวชภัณฑ์สัตว์ เพื่อให้ระบบงานสมาคมธุรกิจเวชภัณฑ์สัตว์
                    มีประสิทธิภาพ ลดความผิดพลาด
                    และเพิ่มประสบการณ์ที่ดีของสมาชิกในการติดต่องานกับสมาคมธุรกิจเวชภัณฑ์สัตว์
                </p>

                <!-- <p class="info-indent mt-n3">
            5. เพื่อพัฒนา Platform Job Matching
            เพื่อจับคู่ระหว่างสภาวิชาชีพสังคมสงเคราะห์และสมาชิกสภาวิชาชีพสังคมสงเคราะห์
            นักสังคมสงเคราะห์ และอื่นๆ
          </p> -->

                <p class="info-indent mt-n3">
                    หากภายหลังมีการเปลี่ยนแปลงวัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคล สมาคมธุรกิจเวชภัณฑ์สัตว์
                    จะแจ้งให้ท่านทราบและขอความยินยอมจากท่านเพิ่มเติม

                </p>

                <p class="info-title">2. ข้อมูลที่เจ้าของข้อมูลให้ไว้โดยตรง</p>

                <p class="info-indent mt-n3">
                    2.1 ข้อมูลที่ท่านให้ไว้ตามเอกสารความยินยอมในการเก็บรวบรวม ใช้
                    หรือเปิดเผยข้อมูลส่วนบุคคลสำหรับผู้ใช้งานระบบสมาชิกของสมาคมธุรกิจเวชภัณฑ์สัตว์ เช่น

                </p>

                <p class="sub-info-indent mt-n3">
                    ก. ข้อมูลส่วนตัว ได้แก่ คํานําหน้า, ชื่อ-นามสกุล, วันเดือนปีเกิด (ค.ศ.), เลขบัตรประชาชน,
                    ข้อมูลที่อยู่ปัจจุบัน, อีเมลและหมายเลขเบอร์โทรศัพท์
                </p>

                <p class="info-indent mt-n3">
                    2.2 เมื่อท่านประสงค์จะติดต่อสอบถามข้อมูลสมาคมธุรกิจเวชภัณฑ์สัตว์
                    สมาคมธุรกิจเวชภัณฑ์สัตว์อาจขอข้อมูลเพื่อยืนยันตัวตนกับท่านและสมาคมธุรกิจเวชภัณฑ์สัตว์
                    อาจบันทึกข้อมูลการติดต่อของท่่านในระบบสมาชิกของสมาคมธุรกิจเวชภัณฑ์สัตว์
                    เพื่อที่สมาคมธุรกิจเวชภัณฑ์สัตว์จะได้ดำเนินการตอบกลับข้อมูลได้อย่างถูกต้อง
                </p>

                <p class="info-title">3. ข้อจำกัดในการนำข้อมูลส่วนบุคคลไปใช้</p>

                <p class="info-indent mt-n3">
                    3.1 สมาคมธุรกิจเวชภัณฑ์สัตว์จะเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคลของท่านเพื่อวัตถุประสงค์ตามข้อ
                    1 เท่านั้น
                </p>

                <p class="info-indent mt-n3">
                    3.2 สมาคมธุรกิจเวชภัณฑ์สัตว์จะดูแลไม่ให้ผู้ปฏิบัติงานของสมาคมธุรกิจเวชภัณฑ์สัตว์เปิดเผย แสดง
                    หรือทำให้ปรากฏในลักษณะอื่นใดซึ่งข้อมูลส่วนบุคคลของท่านต่อบุคคลภายนอก เว้นแต่
                    ได้รับความยินยอมเป็นหนังสือจากท่าน, เป็นกรณีที่กฎหมายกำหนด, เป็นไปเพื่อประโยชน์ของท่าน
                    และการขอความยินยอมไม่อาจกระทำได้ในเวลานั้น, เป็นไปเพื่อประโยชน์เกี่ยวกับชีวิต สุขภาพ
                    หรือความปลอดภัยของท่านและผู้ใช้บริการท่านอื่น, เพื่อประโยชน์แก่การสอบสวนของพนักงานสอบสวน
                    หรือการพิจารณาพิพากษาคดีของศาล, เพื่อประโยชน์ในการศึกษา วิจัย หรือการจัดทำสถิติ
                </p>

                <p class="info-indent mt-n3">
                    3.3 ในบางกรณีสมาคมธุรกิจเวชภัณฑ์สัตว์อาจกำหนดให้บุคคลหรือนิติบุคคลที่เป็นผู้รับจ้าง
                    เก็บรักษาข้อมูลส่วนบุคคลดำเนินการใดๆ เพื่อรักษาความปลอดภัยของข้อมูลของท่าน
                    โดยห้ามนำข้อมูลไปใช้นอกเหนือจากที่กำหนดให้ดำเนินการ
                </p>

                <p class="info-title">4. การรักษาความมั่นคงปลอดภัย</p>

                <p class="info-indent mt-n3">
                    สมาคมธุรกิจเวชภัณฑ์สัตว์กำหนดให้มีมาตรการในการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลอย่างเหมาะสมและสอดคล้องกับ
                    การรักษาความลับของข้อมูลส่วนบุคคล เพื่อป้องกันการสูญหาย การเข้าถึง ทำลาย ใช้ แปลง
                    แก้ไขหรือเปิดเผยข้อมูลส่วนบุคคลโดยไม่มีสิทธิหรือโดยไม่ชอบด้วยกฎหมาย
                    โดยให้เป็นไปตามที่กำหนดในนโยบายเรื่องการรักษาความมั่นคงปลอดภัยข้อมูลส่วนบุคคล
                </p>

                <p class="info-title">5. สิทธิของเจ้าของข้อมูล</p>

                <p class="info-indent mt-n3">
                    5.1 สิทธิในการแจ้งให้เจ้าของข้อมูลส่วนบุคคลทราบก่อนหรือในขณะเก็บรวบรวมข้อมูลส่วนบุคคล
                </p>

                <p class="info-indent mt-n3">
                    5.2 สิทธิในการเพิกถอนความยินยอมให้สมาคมธุรกิจเวชภัณฑ์สัตว์ประมวลผลข้อมูลส่วนบุคคลของท่าน
                </p>

                <p class="info-indent mt-n3">
                    5.3 สิทธิในการเข้าถึงและรับสำเนาข้อมูลส่วนบุคคลที่สมาคมธุรกิจเวชภัณฑ์สัตว์ได้เก็บรวบรวม ใช้ เปิดเผย
                </p>

                <p class="info-indent mt-n3">
                    5.4 สิทธิในการขอให้โอนย้ายข้อมูลส่วนบุคคลของท่าน
                </p>

                <p class="info-indent mt-n3">
                    5.5 สิทธิในการคัดค้าน การประมวลผลข้อมูลส่วนบุคคลของท่าน
                </p>

                <p class="info-indent mt-n3">
                    5.6 สิทธิในการขอให้ลบ ทำลาย หรือทำให้ข้อมูลส่วนบุคคลของท่านซึ่งไม่อาจระบุตัวตนได้
                </p>

                <p class="info-indent mt-n3">
                    5.7 สิทธิในการระงับการใช้ข้อมูลส่วนบุคคลของท่าน
                </p>

                <p class="info-indent mt-n3">
                    5.8 สิทธิในการขอแก้ไขข้อมูลส่วนบุคคลของท่านให้ถูกต้องเป็นปัจจุบัน สมบูรณ์
                    และไม่ก่อให้เกิดความเข้าใจผิด
                </p>

                <p class="info-indent mt-n3">
                    5.9 สิทธิที่จะร้องเรียนในกรณีที่ท่านเห็นว่าถูกสมาคมธุรกิจเวชภัณฑ์สัตว์
                    หรือเจ้าหน้าที่หรือตัวแทนของสมาคมธุรกิจเวชภัณฑ์สัตว์ ละเมิดสิทธิตาม
                    พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
                </p>

                <p class="info-indent mt-n3">
                    5.10 ท่านสามารถแจ้งความประสงค์การดำเนินการตามข้อ 5.1 ถึงข้อ 5.9 ได้
                    โดยแจ้งมายังสมาคมธุรกิจเวชภัณฑ์สัตว์ nantarat.sueb@gmail.com หรือโทร 092-271-2050
                </p>

                <p class="info-title">6. ระยะเวลาการเก็บข้อมูล</p>

                <p class="info-indent">
                    สมาคมธุรกิจเวชภัณฑ์สัตว์จะจัดเก็บ ใช้ และเปิดเผยข้อมูลส่วนบุคคลของท่าน และข้อมูลอื่น ๆ เป็นระยะเวลา
                    5 ปี หรือจนกว่าท่านจะยกเลิกการให้ความยินยอม
                </p>

                <p class="info-title">
                    7. กรณีสมาคมมัณฑนากรแห่งประเทศไทย แบ่งปันข้อมูลของท่านให้แก่บุคคลที่สาม
                </p>

                <p class="info-indent">
                    1.สมาคมธุรกิจเวชภัณฑ์สัตว์จะเปิดเผยข้อมูลของท่านแก่บุคคลที่สามใดๆ
                    ที่จำเป็นต้องใช้ข้อมูลดังกล่าวเพื่อวัตถุประสงค์ตามข้อ 1 หรือเพื่อให้บริการ
                    หรือเพื่อช่วยดำเนินการตามคำขอของท่านเท่านั้น โดยบุคคลที่สามหมายความรวมถึง
                </p>

                <p class="sub-info-indent mt-n3">
                    (1) บริษัท อินเทอร์เน็ตประเทศไทย จํากัด (มหาชน) และ บริษัท ไอรีครูท จํากัด
                    ในฐานะ บริษัทที่พัฒนาระบบสมาชิกของสมาคมธุรกิจเวชภัณฑ์สัตว์
                </p>

                <p class="sub-info-indent mt-n3">
                    (2) บริษัท วัน เซ็นทริค จำกัด ในฐานะบริษัทที่พัฒนาระบบ One Platform
                    ให้กับระบบสมาชิกของสมาคมธุรกิจเวชภัณฑ์สัตว์
                </p>

                <!-- <p class="sub-info-indent mt-n3">
            (3) บริษัท วัน ออเทน จำกัด ในฐานะบริษัทที่พัฒนาระบบ CA
            ให้กับระบบสภาวิชาชีพสังคมสงเคราะห์
          </p>
  
          <p class="sub-info-indent mt-n3">
            (4) บริษัท วัน เซ็นทริค จำกัด ในฐานะบริษัทที่พัฒนาระบบ One Box และ One
            Platform ให้กับระบบสภาวิชาชีพสังคมสงเคราะห์
          </p>
  
          <p class="sub-info-indent mt-n3">
            (5) บริษัท แชท มี จำกัด ในฐานะบริษัทที่พัฒนาระบบ Chat Bot
            ให้กับระบบสภาวิชาชีพสังคมสงเคราะห์
          </p>
  
          <p class="sub-info-indent mt-n3">
            (6) บริษัท ไทย ดอท คอม เพย์เมนท์ จำกัด ในฐานะบริษัทที่พัฒนาระบบ
            E-Payment ให้กับระบบสภาวิชาชีพสังคมสงเคราะห์
          </p> -->

                <p class="info-indent mt-n3">
                    2. บุคคลอื่น ๆ เมื่อมีกฎหมายกำหนดไว้หรือมีความจำเป็นที่จะคุ้มครองบริการของสมาคมธุรกิจเวชภัณฑ์สัตว์
                    เช่น เมื่อกฎหมาย กระบวนการทางกฎหมาย หรือคำสั่งศาลจากเจ้าหน้าที่ภาครัฐผู้มีอำนาจ
                    บังคับให้เปิดเผยข้อมูลของท่าน นอกจากนี้
                    ยังอาจมีการขอข้อมูลของท่านเพื่อวัตถุประสงค์ในการบังคับใช้กฎหมาย ความปลอดภัยของชาติ
                    การต่อต้านการก่อการร้าย หรือการอื่นๆ ที่เกี่ยวข้องกับความปลอดภัยสาธารณะ
                </p>

                <p class="info-indent mt-n3">
                    3. บุคคลอื่น ๆ ที่มีส่วนเกี่ยวข้องกับธุรกรรมของสมาคมธุรกิจเวชภัณฑ์สัตว์
                    อาจเปิดเผยข้อมูลของท่านให้กับบุคคลที่สามโดยเป็นส่วนหนึ่งของการควบรวมกิจการหรือการโอนกิจการ
                    หรือในสถานการณ์ของการล้มละลาย
                </p>

                <p class="info-indent mt-n3">
                    4. บุคคลอื่น ๆ โดยได้รับความยินยอมจากท่าน หรือทำตามคำแนะนำของท่าน
                    สมาคมธุรกิจเวชภัณฑ์สัตว์อาจแบ่งปันข้อมูลเกี่ยวกับท่านให้กับบุคคลที่สามเมื่อท่านยินยอมหรือร้องขอต่างหากให้มีการแบ่งปันดังกล่าว
                </p>

                <p class="info-title">8. กรณีเกิดข้อมูลรั่วไหล/ละเมิดข้อมูล</p>

                <p class="info-indent mt-n3">
                    ในกรณีที่มีข้อมูลรั่วไหล และ/หรือ เหตุการละเมิดข้อมูลส่วนบุคคล
                    สมาคมธุรกิจเวชภัณฑ์สัตว์จะแจ้งเหตุและแนวทางการเยียวยาตามสมควรแก่เจ้าของข้อมูลโดยไม่ชักช้านับแต่ทราบ
                    ทั้งนี้ วิธีการแจ้งและข้อยกเว้นใด ๆ ให้เป็นไปตามหลักเกณฑ์และวิธีการที่สมาคมธุรกิจเวชภัณฑ์สัตว์กำหนด
                </p>

                <p class="info-title">
                    9. ความรับผิดชอบของบุคคลซึ่งทำหน้าที่ควบคุมข้อมูล
                </p>

                <p class="info-indent mt-n3">
                    สมาคมธุรกิจเวชภัณฑ์สัตว์กำหนดให้ผู้ควบคุมข้อมูลส่วนบุคคลต้องปฏิบัติตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
                    พ.ศ.2562 ระเบียบ คำสั่ง
                    รวมถึงนโยบายและหลักเกณฑ์ภายในที่สมาคมธุรกิจเวชภัณฑ์สัตว์กำหนดไว้อย่างเคร่งครัด
                </p>

                <p class="info-title">10. ช่องทางการติดต่อ</p>

                <p class="info-indent mt-n3">
                    ที่อยู่ สมาคมธุรกิจเวชภัณฑ์สัตว์ 2/9 หมู่ 3 ถ.รังสิต-นครนายก ต.ลำผักกูด อ.ธัญบุรี จ.ปทุมธานี 12110
                </p>
                <p class="info-indent mt-n3">
                    โทร 0-2905-5138 กด 2 หรือ 092-271-2050
                </p>
                <p class="info-indent mt-n3">
                    Email nantarat.sueb@gmail.com
                </p>

                <p class="info-indent">
                    ข้าพเจ้าตกลงยินยอมที่จะผูกพันตนเองตามข้อกำหนดและเงื่อนไขที่ปรากฏในหนังสือขอความยินยอมในการเก็บรวบรวม
                    ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลสำหรับผู้ใช้งานระบบสมาชิกของสมาคมธุรกิจเวชภัณฑ์สัตว์
                </p>
            </div>

        </v-card>

        <v-footer height="65" fixed padless class="pt-3 pb-6 px-3" color="#ebf4ff">
            <v-row no-gutters justify="center">
                <div class="censent-btn">
                    <v-btn color="rgba(120, 205, 107, 1)" @click="submitConsent()" block>
                        <span style="color: white"> รับทราบ </span>
                    </v-btn>
                </div>
            </v-row>
        </v-footer>

    </div>
</template>
<script>
export default {
    layout: 'blank',
    components: {
    },
    data() {
        return {
            scrolledToBottom: false,
            loading: true
        }
    },
    mounted() {
        this.scroll()
    },
    computed: {},
    async created() {
        this.token = this.$route.query.token
        await this.consentApprove()
    },
    methods: {
        scroll() {
            window.onscroll = () => {
                const bottomOfWindow = Math.max(window.pageYOffset, document.documentElement.scrollTop, document.body.scrollTop) + window.innerHeight === document.documentElement.offsetHeight

                if (bottomOfWindow) {
                    this.scrolledToBottom = true // replace it with your code
                }
            }
        },
        async submitConsent() {
            const accountId = localStorage.getItem("accountId");
            try {
                await this.$axios.$post('/api/auth/insertLogConsent', { account_id: accountId });
                this.$router.push('/user');
            } catch (err) {
                console.log('err :>> ', err);
            }
        },
        async consentApprove() {
            this.loading = true
            try {
                const res = await this.$axios.$post('/api/auth/login_one', { share_token: this.token })
                localStorage.setItem('accessTokenApha', res.result.access_token)
                localStorage.setItem('accountId', res.result.account_id)
                if (res.message === "loginOneToken Success") {
                    if (res.result) {
                        localStorage.setItem('dataLogin', JSON.stringify(res.result))
                        this.loading = false
                    } else {
                        await this.$swal({
                            icon: 'error',
                            title: 'ไม่พบข้อมูล',
                            showConfirmButton: false,
                            allowOutsideClick: false
                        })
                    }
                }
            } catch (error) {
                await this.$swal({
                    icon: 'error',
                    title: 'พบข้อผิดพลาด',
                    showConfirmButton: false,
                    allowOutsideClick: false
                })
            }
        }
    }
}

</script>

<style scoped>
.font-title {
    font-size: 16px;
}

.page-body {
    background-color: #ebf4ff;
    height: 100%;

    padding-bottom: 70px !important;

}

.card-consent {
    border-radius: 16px !important;
}

.absolute-position {
    position: absolute;
    top: 50%;
    left: 50%;
    -ms-transform: translate(-50%, -50%);
    transform: translate(-50%, -50%);
}

.text-title {
    font-weight: bold;
    font-size: 14px;
    text-align: center;
}

.card-info {

    padding: 0px 50px 0px 50px;
}

.card-info p {
    font-size: 12px;
    color: #808080;

}

.info-title {
    font-weight: bold;
    color: #333;
}

.info-indent {
    padding: 0 0 0 15px;
    text-indent: 30px;
}

.sub-info-indent {
    padding: 0 0 0 45px;
    text-indent: 30px;
}

.censent-btn {
    width: 140px;
}

@media (max-width: 425px) {

    .card-info {

        padding: 0px 16px 0px 16px;
    }

    .censent-btn {
        width: 100%;
    }

}
</style>